app/controllers/school_classes_controller.rb

  def create
	  @school_class = SchoolClass.new
	  @school_class.title = params[:school_class_title]
	  @school_class.room_number = params[:school_class_room_number]
	  @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-03-17 19:12:53.620959"], ["updated_at", "2019-03-17 19:12:53.620959"]]

  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(school_params(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-03-18 11:52:39.653203"], ["id", 1]]