app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["created_at", "2019-03-18 11:59:37.370597"], ["updated_at", "2019-03-18 11:59:37.370597"]]
---
  def create
    @student = Student.new
    @student.first_name = params[:student_first_name]
    @student.last_name = params[:student_last_name]
    @student.save